/* Создать целочисленные и вещественные переменные. Вычислить их сумму, произведение, частное. Результат вывести на экран.
*/

int num1 = 5;
int num2 = 9;
int sum = num1 + num2;
Console.WriteLine(sum);


