// Вывод текстового сообщения

Console.WriteLine("Hello, world!");

/*
   Арифметические операции

Операция            | Cимволы
----------------------------
Сложение            |   +
----------------------------
Вычитание           |   -
----------------------------
Умножение           |   *
----------------------------
Деление             |   /
----------------------------
Деление с остатком  |   %

*/
 
Console.WriteLine("-----");

/*Пример №1. Объявить переменную, инициализировать ее некоторым значением и вывести его на экран.
 Создание переменной состоит из трёх этапов:
 int value = 100;
 1. Указание типа                            int
 2. Указание имени (идентификатор)           value
 3. Инициализация                            100
*/

int value = 100;
Console.WriteLine(value);

/* Основные Типы данных.
 
 Тип данных               |  Ключевое слово      | Диапазон значений
--------------------------------------------------------------------------------         
Целые                     |  int                 |-2*10^31...2*10^31
                          ------------------------------------------------------
                          |    long              |-2*10^63...2*10^63
--------------------------------------------------------------------------------
Вещественные              |   float              |+-1.5*10^(-45)...+-3.4*10^38
                          ------------------------------------------------------
                          |     double           |+-5*10^(-324)...+-1.7*10^308
-------------------------------------------------------------------------------- 
 Символьный               |       char           |0...65535(код символа)
--------------------------------------------------------------------------------
 Логический               |   bool               | False or True
--------------------------------------------------------------------------------
*/

