// Вывод текстового сообщения

Console.WriteLine("Hello, world!");

/*
   Арифметические операции

Операция            | Cимволы
----------------------------
Сложение            |   +
----------------------------
Вычитание           |   -
----------------------------
Умножение           |   *
----------------------------
Деление             |   /
----------------------------
Деление с остатком  |   %

*/

/*Пример №1. Объявить переменную, инициализировать ее некоторым значением и вывести его на экран.
 Создание переменной состоит из трёх этапов:
 int value = 100;
 1. Указание типа                            int
 2. Указание имени (идентификатор)           value
 3. Инициализация                            100
*/

