/*Задача №3. 
Даны два целых числа. Вывести на экран большее из них.
*/

int num1 = 4;
int num2 = 8;
if (num1 > num2){
    Console.WriteLine(num1);
}

else{
    Console.WriteLine(num2);
}

